-- MySQL dump 10.13  Distrib 8.0.44, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: homework
-- ------------------------------------------------------
-- Server version	8.0.44

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `authors`
--

DROP TABLE IF EXISTS `authors`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `authors` (
  `Code_author` int DEFAULT NULL,
  `name_author` text,
  `Birthday` text
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `authors`
--

LOCK TABLES `authors` WRITE;
/*!40000 ALTER TABLE `authors` DISABLE KEYS */;
INSERT INTO `authors` VALUES (1,' Александр Беляев','1884.03.16'),(2,' Александр Блок','1880.11.28'),(3,' Александр Грибоедов','1795.01.15'),(4,' Александр Грин','1880.08.23'),(5,' Александр Дюма','1802.07.24'),(6,' Александр Куприн','1870.09.07'),(7,' Александр Островский','1823.04.12'),(8,' Александр Пушкин','1799.06.06'),(9,' Алексей Толстой','1883.01.10'),(10,' Андрей Вознесенский','12.05.1933'),(11,' Анна Ахматова','1889.06.23'),(12,' Антон Чехов','1860.01.29'),(13,' Антуан де Сент-Экзюпери','29.06.1900'),(14,' Арсений Тарковский','25.06.1907'),(15,' Артур Конан Дойл','1859.05.22'),(16,' Афанасий Фет','1820.05.12'),(17,' Борис Васильев','21.05.1924'),(18,' Борис Пастернак','1890.02.10'),(19,' Валентин Катаев','1897.01.28'),(20,' Вениамин Каверин','19.04.1902'),(21,' Владимир Высоцкий','25.01.1938'),(22,' Владимир Гиляровский','1855.12.08'),(23,' Владимир Маяковский','1893.07.19'),(24,' Владимир Обручев','1863.09.28'),(25,' Габриэль Гарсиа Маркес','06.03.1927'),(26,' Даниель Дефо','1660.09.13'),(27,' Джек Лондон','1876.01.12'),(28,' Джордж Оруэлл','25.06.1903'),(29,' Иван Бунин','1870.10.22'),(30,' Иван Гончаров','1812.06.18'),(31,' Иван Крылов','1769.02.13'),(32,' Иван Тургенев','1818.11.09'),(33,' Иоганн Вольфганг фон Гёте','1749.08.28'),(34,' Кен Кизи','17.09.1935'),(35,' Лев Толстой','1828.09.09'),(36,' Марина Цветаева','1892.10.08'),(37,' Михаил Булгаков','1891.05.15'),(38,' Николай Гоголь','1809.04.01'),(39,' Николай Некрасов','1821.12.10'),(40,' Николай Чернышевский','1828.07.24'),(41,' Осип Мандельштам','1891.01.15'),(42,' Роберт Льюис Стивенсон','1850.11.13'),(43,' Рэй Брэдбери','22.08.1920'),(44,' Сергей Есенин','1895.10.03'),(45,' Станислав Лем','12.09.1921'),(46,' Уильям Шекспир','1594.04.26'),(47,' Федор Достоевский','1821.11.11'),(48,' Федор Тютчев','1803.12.05'),(49,' Эрих Мария Ремарк','1898.06.22'),(50,' Эрнест Хемингуэй','1899.07.21'),(51,' Ярослав Гашек','1883.04.30'),(52,'Виктор Гюго','1802.02.26'),(53,'Михаил Булгаков','1891.05.15'),(54,'Михаил Лермонтов','1814.10.15'),(55,'Михаил Шолохов','24.05.1905');
/*!40000 ALTER TABLE `authors` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2026-03-18 11:20:37
